/*************************************
* Автор:   Хребтов Андрей
* Задание: Линейные алгоритмы
* Вариант: 13
*
*
*
************************************/

#include <iostream> 
#include <cmath>
using namespace std;
int main() {
  //стороны нижестоящего основания
  double a1 = 6.37;
  double b1 = 7.75;
  double c1 = 10.1;

  //стороны верхнего основания
  double a2 = 4.63;
  double b2 = 6.92;
  double c2 = 8.53;

  //высота
  double h = 21.47;

  //площади оснований
  double s1 = 0;
  double s2 = 0;

  //полупириметр треугольника
  double p1 = 0;
  double p2 = 0;

  //высота центра тяжести
  double e = 0;

  //расчет p
  p1 = (a1 + b1 + c1) / 2;
  p2 = (a2 + b2 + c2) / 2;

  //расчет s
  s1 = pow(p1 * ((p1 - a1) * (p1 - b1) * (p1 - c1)), 0.5);
  s2 = pow(p2 * ((p2 - a2) * (p2 - b2) * (p2 - c2)), 0.5);

  //расчет e
  e = (h / 4) * (s1 + 2 * pow(s1 * s2, 0.5) + 3 * s2) / (s1 + pow(s1 * s2, 0.5) + s2);

  //тест
  cout << e;
}